app/controllers/movies_controller.rb

  def index
    @all_ratings = Movie.ratings
    sort = params[:sort]
    ratings = params[:ratings]
    if ratings.is_a?(Array)
		if !ratings.empty?
			ratings.each do |x|
				string = ":rating => x.key AND"
			end
			@movies = Movie.find(string)
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'R') ORDER BY release_date DESC
SELECT "movies".* FROM "movies" WHERE "movies"."id" IN (1, 2, 3, 4, 5, 6, 7, 8, 9, 10) ORDER BY title ASC